app/views/components/_form.html.erb

SELECT  1 AS one FROM "measurements" INNER JOIN "components_measurements" ON "measurements"."id" = "components_measurements"."measurement_id" WHERE "components_measurements"."component_id" = $1 AND "measurements"."id" = $2 LIMIT 1  [["component_id", 1], ["id", 1]]
SELECT "measurements".* FROM "measurements"
---
  <% @measurements.order(:name).each do |measurement| %>
    <%= check_box_tag "measurements[]" , measurement.id , @component_measurements.include?(measurement) ? true : false %>

SELECT  1 AS one FROM "options" INNER JOIN "components_options" ON "options"."id" = "components_options"."option_id" WHERE "components_options"."component_id" = $1 AND "options"."id" = $2 LIMIT 1  [["component_id", 2], ["id", 1]]
---
    <% @options.order(:name).each do |option| %>
      <%= check_box_tag "options[]" , option.id , @component_options.include?(option) ? true : false %>