app/controllers/amputation_levels_controller.rb

  def index
    @amputation_levels = AmputationLevel.all
---
SELECT "amputation_levels".* FROM "amputation_levels"  ORDER BY name ASC

  def create
    @amputation_level = AmputationLevel.new(amputation_level_params)

    respond_to do |format|
      if @amputation_level.save
---
INSERT INTO "amputation_levels" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Level1"], ["description", "This is the first level"], ["created_at", "2016-08-29 00:53:09.505918"], ["updated_at", "2016-08-29 00:53:09.505918"]]

    def set_amputation_level
      @amputation_level = AmputationLevel.find(params[:id])
---
SELECT  "amputation_levels".* FROM "amputation_levels" WHERE "amputation_levels"."id" = $1 LIMIT 1  [["id", 1]]