app/controllers/components_controller.rb

SELECT "components".* FROM "components"  ORDER BY name ASC
---
  def index
    @components = Component.all

SELECT "measurements".* FROM "measurements"
SELECT  "options".* FROM "options"  ORDER BY "options"."id" ASC LIMIT 1
SELECT "amputation_levels".* FROM "amputation_levels"
---
  def new
    @measurements = Measurement.all
    @options = Option.all
    @amputation_levels  = AmputationLevel.all

SELECT "options".* FROM "options"
SELECT "measurements".* FROM "measurements"
---
  def edit
    @amputation_levels  = AmputationLevel.all
    @component_amputation_level = @component.amputation_levels
    @options = Option.all
    @component_options = @component.options
    @measurements = Measurement.all

INSERT INTO "components" ("name", "icon_file_name", "icon_content_type", "icon_file_size", "icon_updated_at", "version", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "measurements".* FROM "measurements" INNER JOIN "components_measurements" ON "measurements"."id" = "components_measurements"."measurement_id" WHERE "components_measurements"."component_id" = $1  [["component_id", 1]]
SELECT  "amputation_levels".* FROM "amputation_levels" WHERE "amputation_levels"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "options".* FROM "options" WHERE "options"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @component = Component.new(component_params)

    respond_to do |format|
      if @component.save
        #set measurements
        if params[:measurements]
          params[:measurements].each do |measurement|
            @component.measurements.push(Measurement.find(measurement))
          end
        end
        #set levels
        if params[:levels]
          params[:levels].each do |level|
            @component.amputation_levels.push(AmputationLevel.find(level))
          end
        end
        #set options
        if params[:options]
          params[:options].each do |option|
            @component.options.push(Option.find(option))

UPDATE "components" SET "version" = $1, "updated_at" = $2 WHERE "components"."id" = $3  [["version", 2.0], ["updated_at", "2016-08-29 01:37:00.106636"], ["id", 2]]
SELECT "measurements".* FROM "measurements" INNER JOIN "components_measurements" ON "measurements"."id" = "components_measurements"."measurement_id" WHERE "components_measurements"."component_id" = $1  [["component_id", 1]]
SELECT  "amputation_levels".* FROM "amputation_levels" WHERE "amputation_levels"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "options".* FROM "options" INNER JOIN "components_options" ON "options"."id" = "components_options"."option_id" WHERE "components_options"."component_id" = $1  [["component_id", 2]]
SELECT  "components".* FROM "components" WHERE "components"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
    respond_to do |format|
      if @component.update(component_params)
        @component.measurements.clear
        #reset measurements
        if params[:measurements]
          params[:measurements].each do |measurement|
            @component.measurements.push(Measurement.find(measurement))
          end
        end
        #reset levels
        if params[:levels]
          @component.amputation_levels.clear
          params[:levels].each do |level|
            @component.amputation_levels.push(AmputationLevel.find(level))
          end
        end
        #reset options
        if params[:options]
          @component.options.clear
          params[:options].each do |option|
            @component.options.push(Option.find(option))
          end
        end
        #reset component Types
        if params[:component_types]
          @component.component_types.clear
          params[:component_types].each do |type|
            @component.component_types.push(ComponentType.find(type))

SELECT  "amputation_levels".* FROM "amputation_levels" WHERE "amputation_levels"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "components".* FROM "components" INNER JOIN "amputation_levels_components" ON "components"."id" = "amputation_levels_components"."component_id" WHERE "amputation_levels_components"."amputation_level_id" = $1  [["amputation_level_id", 4]]
---
  def search
  	@components = AmputationLevel.find(params[:query]).component

SELECT  "components".* FROM "components" WHERE "components"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_component
      @component = Component.find(params[:id])