app/controllers/measurements_controller.rb

SELECT  "components".* FROM "components" WHERE "components"."name" = $1 LIMIT 1  [["name", "EbeArm"]]
---
  def search
    @measurements = Component.find_by_name(params[:query]).measurements