app/controllers/measurements_controller.rb

SELECT "measurements".* FROM "measurements"  ORDER BY name ASC
---
  def index
    @measurements = Measurement.all

INSERT INTO "measurements" ("name", "step", "measurement_unit", "diagram_file_name", "diagram_content_type", "diagram_file_size", "diagram_updated_at", "lower_range", "upper_range", "default", "instructions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @measurement = Measurement.new(measurement_params)

    respond_to do |format|
      if @measurement.save

SELECT  "components".* FROM "components" WHERE "components"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "measurements".* FROM "measurements" INNER JOIN "components_measurements" ON "measurements"."id" = "components_measurements"."measurement_id" WHERE "components_measurements"."component_id" = $1  [["component_id", 4]]
---
  def search
    @measurements = Component.find(params[:query]).measurements

SELECT  "measurements".* FROM "measurements" WHERE "measurements"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_measurement
      @measurement = Measurement.find(params[:id])