app/controllers/options_controller.rb

SELECT "options".* FROM "options"
---
  def index
    @options = Option.all

INSERT INTO "options" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Nails"], ["created_at", "2016-08-29 02:29:36.345910"], ["updated_at", "2016-08-29 02:29:36.345910"]]
---
  def create
    @option = Option.new(option_params)

    respond_to do |format|
      if @option.save

UPDATE "options" SET "photo" = $1, "updated_at" = $2 WHERE "options"."id" = $3  [["photo", "#<ActionDispatch::Http::UploadedFile:0x007fa65e3c32d0>"], ["updated_at", "2016-08-29 02:16:29.782046"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @option.update(option_params)

SELECT  "options".* FROM "options" WHERE "options"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_option
      @option = Option.find(params[:id])