app/controllers/terminal_devices_controller.rb

  def search
    @tds = Component.find_by_name(params[:query]).terminal_devices
---
SELECT  "components".* FROM "components" WHERE "components"."name" = $1 LIMIT 1  [["name", "EbeArm"]]