app/controllers/terminal_devices_controller.rb

SELECT  "components".* FROM "components" WHERE "components"."id" = $1 LIMIT 1  [["id", 1]]
---
  def search
    @tds = Component.find(params[:query]).terminal_devices